In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [7]:
labels = ["a", "b", "c"]
my_data = [10,20,30]
arr = np.array(my_data)

d = {"a":10, "b":20, "c":30}
print(arr)

[10 20 30]

In [4]:
pd.Series(data = my_data) #podemos especifiar que indice queremos para nuestros datos, ejemplo:

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_data, index = labels) #aquí estamos escogiendo los índices
#podemos omitir data = my_data,... poniendo: 
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr) #veamos que puede contener string además de int

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data=labels) #de hecho puede funcionar con más tipo de datos

0    a
1    b
2    c
dtype: object

In [8]:
ser1 = pd.Series([1,3,4,5], ["MEX", "USA", "USSR", "JAPAN"])

In [9]:
ser1

MEX      1
USA      3
USSR     4
JAPAN    5
dtype: int64

In [10]:
ser2 = pd.Series([1,3,3,5], ["MEX", "USA", "SPAIN", "JAPAN"])

In [11]:
ser1["USA"]

3

In [12]:
ser1 + ser2

JAPAN    10.0
MEX       2.0
SPAIN     NaN
USA       6.0
USSR      NaN
dtype: float64

In [13]:
np.random.seed(101)

In [14]:
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])
df #notemos q nos da una tabla, parecida a las de excel, donde en primer instancia declaramos los datos dentro de la tabla, luego el número de filas con su etiqueta y al final las columnas, notar que deben ser el mismo numero de datos que tenemos adentro de la tabla 

#CADA COLUMNA REPRESENTA UNA SERIE DE PANDAS, dichas que comparten un mismo índice, es decir, las filas son sus índices

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df["W"] #indexamos la tabla, accedemos a la serie W tambien podemos poner df."W"
df.W

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [42]:
#veamos de que tipo son las columnas para estar seguros
print(type(df["W"])) #type(___) no se pone type.___ pq no es un atributo de type 
print(type(df))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [72]:
df["new"] = df.W + df.Y #esto para sumar columnas
df["new"]

A   -2.129908
B    0.994405
C    1.399521
D    0.705796
E   -2.059691
Name: new, dtype: float64

In [47]:
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -0.992897
B  1.025984 -0.156598 -0.031579  0.649826  1.675810
C  2.154846 -0.610259 -0.755325 -0.346419  1.808428
D  0.147027 -0.479448  0.558769  1.024810  1.171837
E -0.925874  1.862864 -1.133817  0.610478 -0.315396

In [54]:
print(df.drop("A", axis = 0)) #tenemos que especificar que sólo deseamos eliminar laa columna "new", con el axis 0 para index y 1 para columnaas
print(df.drop("new", axis = 1))

          W         X         Y         Z       new
B  1.025984 -0.156598 -0.031579  0.649826  1.675810
C  2.154846 -0.610259 -0.755325 -0.346419  1.808428
D  0.147027 -0.479448  0.558769  1.024810  1.171837
E -0.925874  1.862864 -1.133817  0.610478 -0.315396
          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [56]:
df.drop("new", axis = 1) #notemos que no se guarda este cambio que queremos sobre df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [57]:
df #si deseamos eliminar definitivamente dicha columnda o fila,python con pandas nos da esa opción, sólo hay que marcarla como se hace a continuación:

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -0.992897
B  1.025984 -0.156598 -0.031579  0.649826  1.675810
C  2.154846 -0.610259 -0.755325 -0.346419  1.808428
D  0.147027 -0.479448  0.558769  1.024810  1.171837
E -0.925874  1.862864 -1.133817  0.610478 -0.315396

In [59]:
df.drop("new", axis = 1, inplace = True) #lo hace python por si la eliminación la haces por error :/ por ello te pide que lo confirmes on inplace
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [60]:
#ahoraa veamos la manera de acceder a toda una fila 
df.loc["B"]

W    1.025984
X   -0.156598
Y   -0.031579
Z    0.649826
Name: B, dtype: float64

In [63]:
df.iloc[1] #veamos que son dos maneras de llamar a una fila, una por el número del indice y otra por como esta declarada

W    1.025984
X   -0.156598
Y   -0.031579
Z    0.649826
Name: B, dtype: float64

In [65]:
df.loc["B", "X"] #accedimos a un dato en concreto de esta manera, ahora veamos si queremos sacar una sub-tabla de df

-0.1565979042889875

In [69]:
df.loc[["B","D"],["X","Z"]]

          X         Z         Y
B -0.156598  0.649826 -0.031579
D -0.479448  1.024810  0.558769

In [79]:
#comparemos datos, en este caso veamos qué datos son mayores que 0
boolean_df = df > 0
boolean_df

       W      X      Y      Z    new
A  False   True  False   True  False
B   True  False  False   True   True
C   True  False  False  False   True
D   True  False   True   True   True
E  False   True  False   True  False

In [80]:
df[boolean_df] #o bien, para q sea más optimo, podemos decir df[df>0]

          W         X         Y         Z       new
A       NaN  0.196800       NaN  0.000366       NaN
B  1.025984       NaN       NaN  0.649826  0.994405
C  2.154846       NaN       NaN       NaN  1.399521
D  0.147027       NaN  0.558769  1.024810  0.705796
E       NaN  1.862864       NaN  0.610478       NaN

In [81]:
df["X"]>0 #podemos evaluar boolean por columna

A     True
B    False
C    False
D    False
E     True
Name: X, dtype: bool

In [82]:
df[df["X"]>0] #sólo obtendras las filas en las q es verdad, es decir, A y E

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [85]:
#ahora supongamos el caso en el que no deseamos las demás columnas, entonces hacemos lo siguiente:
df[df["X"]>0][["X"]] #ahora veamos is buscamos que nos regrese dos columnas

          X
A  0.196800
E  1.862864

In [86]:
df[df["X"]>0][["X","W"]]

          X         W
A  0.196800 -0.993263
E  1.862864 -0.925874

In [88]:
df[(df["Z"]>0) & (df["new"]>0)] #ambos tienen valores true en las filas B y D

          W         X         Y         Z       new
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
D  0.147027 -0.479448  0.558769  1.024810  0.705796

In [94]:
df[(df["Y"]>0) | (df["Z"]>0)] #nos dan todos los renglones donde Y o Z son true

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [102]:
rewind = "MX USA CA OR CO".split() #pondrá en una lista cada elemento separado por el espacio, si las vamos a agregaar a un DataFRame, debemos asegurarnos que numero de elementos de la lista sea igual con el numero de las filas

In [97]:
rewind

['MX', 'USA', 'CA', 'OR', 'CO']

In [103]:
df["States"] = rewind

In [99]:
df

          W         X         Y         Z       new States
A -0.993263  0.196800 -1.136645  0.000366 -2.129908     MX
B  1.025984 -0.156598 -0.031579  0.649826  0.994405    USA
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521     CA
D  0.147027 -0.479448  0.558769  1.024810  0.705796     OR
E -0.925874  1.862864 -1.133817  0.610478 -2.059691     CO

In [105]:
#ahora supongamos que deseamos que nuestra columnda de indices sean los States, entonces hacemos:
df.set_index("States")

               W         X         Y         Z       new
States
MX     -0.993263  0.196800 -1.136645  0.000366 -2.129908
USA     1.025984 -0.156598 -0.031579  0.649826  0.994405
CA      2.154846 -0.610259 -0.755325 -0.346419  1.399521
OR      0.147027 -0.479448  0.558769  1.024810  0.705796
CO     -0.925874  1.862864 -1.133817  0.610478 -2.059691